Autodesk.Navisworks.Api.BoundingBox2D
Axis aligned 2D bounding box. Immutable.

Autodesk.Navisworks.Api.BoundingBox2D.#ctor
Create an empty bounding box

Autodesk.Navisworks.Api.BoundingBox2D.#ctor(Autodesk.Navisworks.Api.Point2D,Autodesk.Navisworks.Api.Point2D)
Create a bounding box from a min and max point that define the opposite corners of the box
Throws System.ArgumentNullException:
Argument 'minPoint' is null
Throws System.ArgumentException:
Argument 'minPoint' has been Disposed
Throws System.ArgumentOutOfRangeException:
A component of minPosition is greater than the corresponding component of maxPosition
Throws System.ArgumentNullException:
Argument 'maxPoint' is null
Throws System.ArgumentException:
Argument 'maxPoint' has been Disposed

Autodesk.Navisworks.Api.BoundingBox2D.Area
Area of bounding box, 0 if empty
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.BoundingBox2D.Center
Center of bounding box
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.BoundingBox2D.Contains(Autodesk.Navisworks.Api.BoundingBox2D)
True if this completely contains box
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'box' is null
Throws System.ArgumentException:
Argument 'box' has been Disposed

Autodesk.Navisworks.Api.BoundingBox2D.Contains(Autodesk.Navisworks.Api.Point2D)
True if this contains point
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'point' is null
Throws System.ArgumentException:
Argument 'point' has been Disposed

Autodesk.Navisworks.Api.BoundingBox2D.Equals(System.Object)
Determines whether the specified object and the current object refer to the same
underlying native object. Returns false if either object has been disposed.

Autodesk.Navisworks.Api.BoundingBox2D.Extend(Autodesk.Navisworks.Api.BoundingBox2D)
Return box that represents union of this with another box
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'box' is null
Throws System.ArgumentException:
Argument 'box' has been Disposed

Autodesk.Navisworks.Api.BoundingBox2D.GetHashCode
Serves as a hash function for a particular type.  is suitable for use in hashing algorithms and data structures like a hash table.
Returns: A hash code for the current .

Autodesk.Navisworks.Api.BoundingBox2D.HasArea
Does bounding box have a non-zero area ?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.BoundingBox2D.Intersect(Autodesk.Navisworks.Api.BoundingBox2D)
Return box that represents intersection of this with another box
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'box' is null
Throws System.ArgumentException:
Argument 'box' has been Disposed

Autodesk.Navisworks.Api.BoundingBox2D.Intersects(Autodesk.Navisworks.Api.BoundingBox2D)
True if this intersects box
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'box' is null
Throws System.ArgumentException:
Argument 'box' has been Disposed

Autodesk.Navisworks.Api.BoundingBox2D.Intersects(Autodesk.Navisworks.Api.Point2D)
True if this intersects point (same as Contains() for a point)
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'point' is null
Throws System.ArgumentException:
Argument 'point' has been Disposed

Autodesk.Navisworks.Api.BoundingBox2D.IsEmpty
Is bounding box empty ?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.BoundingBox2D.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.BoundingBox2D.Max
Return max point that defines corner of box with largest values for all components
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.BoundingBox2D.Min
Return min point that defines corner of box with smallest values for all components
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.BoundingBox2D.Size
Extents of bounding box from min point to max point
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.BoundingBox2D.ToString
Returns a  that represents the current .
Returns: A  that represents the current .

Autodesk.Navisworks.Api.BoundingBox2D.Translate(Autodesk.Navisworks.Api.Vector2D)
Return this box translated by an offset
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'offset' is null
Throws System.ArgumentException:
Argument 'offset' has been Disposed